yii2-app-basic/models/User.php

    public static function findIdentity($id)
    {
        $dbUser = self::find()
            ->where(["cpf" => $id])
            ->one();
---
SELECT * FROM `user` WHERE `cpf`='1'

    public function afterFind(){
        return $this->idTipoUsuario = Tipousuario::findOne($this->idTipoUsuario)->funcao;
---
SELECT * FROM `tipousuario` WHERE `idTipo`=2

 public function senhaAleatoria($cpf)
    {

        $usuario = new User();
        $usuario = User::findOne($cpf);
---
SELECT * FROM `user` WHERE `cpf`='01611589274'