yii2-app-basic/controllers/LocalController.php

INSERT INTO `local` (`Nome`) VALUES ('Estacionamento')
---
    public function actionCreate()
    {
        $model = new Local();

        if ($model->load(Yii::$app->request->post()) && $model->save()) {