yii2-app-basic/controllers/UserController.php

    public function actionForgot()
    {

        if ( Yii::$app->request->post())
        {
            $cpf = new User();
            $cpf->load(Yii::$app->request->post());

           /// $usuario = User::find()->where(['email'=>$email])->one();
            //$usuario = User::findOne($cpf);
          //   echo($usuario->cpf);
            $usuario = new User();
            $usuario = User::findOne($cpf->cpf);
---
SELECT * FROM `user` WHERE `cpf`='01611589274'